# Ultralytics YOLO26-P2-Tracking UAV Detection Model
# 4-scale detection with P2/4-P5/32 outputs optimized for small UAV targets
# Integrates: ECA, CoordAtt, WeightedConcat, DySample

nc: 10
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with ECA-enhanced C3k2 and CoordAtt position attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2_ECA, [256, False, 0.25]]  # 2  ECA-enhanced small feature extraction
  - [-1, 1, CoordAtt, [32]]           # 3  position attention after P2
  - [-1, 1, Conv, [256, 3, 2]]        # 4-P3/8
  - [-1, 2, C3k2_ECA, [512, False, 0.25]]  # 5
  - [-1, 1, CoordAtt, [32]]           # 6  position attention after P3
  - [-1, 1, Conv, [512, 3, 2]]        # 7-P4/16
  - [-1, 2, C3k2, [512, True]]         # 8
  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]]             # 12

# FPN+PAN neck with DySample upsampling and WeightedConcat fusion
head:
  # FPN top-down (4-scale)
  - [-1, 1, DySample, [512, 2]]                                    # 13  upsample P5→P4
  - [[-1, 8], 1, WeightedConcat, [1]]                               # 14  weighted cat + backbone P4
  - [-1, 2, C3k2, [512, True]]                                     # 15
  - [-1, 1, DySample, [256, 2]]                                    # 16  upsample→P3
  - [[-1, 5], 1, WeightedConcat, [1]]                               # 17  weighted cat + backbone P3
  - [-1, 2, C3k2, [256, True]]                                     # 18  (P3/8-small)
  - [-1, 1, DySample, [128, 2]]                                    # 19  upsample→P2
  - [[-1, 2], 1, WeightedConcat, [1]]                               # 20  weighted cat + backbone P2
  - [-1, 2, C3k2, [128, True]]                                     # 21  (P2/4-xsmall)

  # PAN bottom-up (4-scale)
  - [-1, 1, Conv, [128, 3, 2]]                                     # 22  downsample P2→P3
  - [[-1, 18], 1, WeightedConcat, [1]]                              # 23  weighted cat + head P3
  - [-1, 2, C3k2, [256, True]]                                     # 24  (P3/8-small)
  - [-1, 1, Conv, [256, 3, 2]]                                     # 25  downsample→P4
  - [[-1, 15], 1, WeightedConcat, [1]]                              # 26  weighted cat + head P4
  - [-1, 2, C3k2, [512, True]]                                     # 27  (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]                                     # 28  downsample→P5
  - [[-1, 12], 1, WeightedConcat, [1]]                              # 29  weighted cat + backbone C2PSA
  - [-1, 1, C3k2, [1024, True, 0.5, True]]                         # 30  (P5/32-large)

  # Detection head (4 scales)
  - [[21, 24, 27, 30], 1, Detect, [nc]]                            # 31  Detect(P2, P3, P4, P5)
