# YOLOv11n + ECA attention (lightweight channel attention only)
nc: 2
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ECA, [256]]               # 3  ← ECA after P2
  - [-1, 1, Conv, [256, 3, 2]]        # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ECA, [512]]               # 6  ← ECA after P3
  - [-1, 1, Conv, [512, 3, 2]]        # 7-P4/16
  - [-1, 2, C3k2, [512, True]]        # 8
  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 10
  - [-1, 1, SPPF, [1024, 5]]          # 11
  - [-1, 2, C2PSA, [1024]]            # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]       # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]       # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]       # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]       # 24

  - [[18, 21, 24], 1, Detect, [nc]]
