# YOLO26n-P2 UAV Detection Model (2-class: person + vehicle)
# 4-scale detection with P2/4-P5/32 outputs + ECA/CoordAtt/DySample/WeightedConcat

nc: 2
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2_ECA, [256, False, 0.25]]   # 2  ECA
  - [-1, 1, CoordAtt, [32]]            # 3  CoordAtt
  - [-1, 1, Conv, [256, 3, 2]]         # 4-P3/8
  - [-1, 2, C3k2_ECA, [512, False, 0.25]]   # 5  ECA
  - [-1, 1, CoordAtt, [32]]            # 6  CoordAtt
  - [-1, 1, Conv, [512, 3, 2]]         # 7-P4/16
  - [-1, 2, C3k2, [512, True]]          # 8
  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 11
  - [-1, 2, C2PSA, [1024]]              # 12

head:
  - [-1, 1, DySample, [512, 2]]                                     # 13
  - [[-1, 8], 1, WeightedConcat, [1, 2]]                            # 14
  - [-1, 2, C3k2, [512, True]]                                      # 15
  - [-1, 1, DySample, [256, 2]]                                     # 16
  - [[-1, 5], 1, WeightedConcat, [1, 2]]                            # 17
  - [-1, 2, C3k2, [256, True]]                                      # 18
  - [-1, 1, DySample, [128, 2]]                                     # 19
  - [[-1, 2], 1, WeightedConcat, [1, 2]]                            # 20
  - [-1, 2, C3k2, [128, True]]                                      # 21
  # PAN
  - [-1, 1, Conv, [128, 3, 2]]                                      # 22
  - [[-1, 18], 1, WeightedConcat, [1, 2]]                           # 23
  - [-1, 2, C3k2, [256, True]]                                      # 24
  - [-1, 1, Conv, [256, 3, 2]]                                      # 25
  - [[-1, 15], 1, WeightedConcat, [1, 2]]                           # 26
  - [-1, 2, C3k2, [512, True]]                                      # 27
  - [-1, 1, Conv, [512, 3, 2]]                                      # 28
  - [[-1, 12], 1, WeightedConcat, [1, 2]]                           # 29
  - [-1, 1, C3k2, [1024, True, 0.5, True]]                          # 30
  # 4-scale detection
  - [[21, 24, 27, 30], 1, Detect, [nc]]                             # 31
